emacs.d/configuration.org
#+TITLE: Emacs configuration

* Before starting:

** Usage of =use-package=

#+BEGIN_EXAMPLE
(use-package package-name
	 [:keyword [option]]...)

:init          Code to run before PACKAGE-NAME has been loaded.
:config        Code to run after PACKAGE-NAME has been loaded.  Note that if
			   loading is deferred for any reason, this code does not execute
			   until the lazy load has occurred.
:preface       Code to be run before everything except `:disabled'; this can
			   be used to define functions for use in `:if', or that should be
			   seen by the byte-compiler.
:mode          Form to be added to `auto-mode-alist'.
:interpreter   Form to be added to `interpreter-mode-alist'.
:commands      Define autoloads for commands that will be defined by the
			   package.  This is useful if the package is being lazily loaded,
			   and you wish to conditionally call functions in your `:init'
			   block that are defined in the package.
:bind          Bind keys, and define autoloads for the bound commands.
:bind*         Bind keys, and define autoloads for the bound commands,
			   *overriding all minor mode bindings*.
:bind-keymap   Bind a key prefix to an auto-loaded keymap defined in the
			   package.  This is like `:bind', but for keymaps.
:bind-keymap*  Like `:bind-keymap', but overrides all minor mode bindings
:defer         Defer loading of a package -- this is implied when using
			   `:commands', `:bind', `:bind*', `:mode' or `:interpreter'.
			   This can be an integer, to force loading after N seconds of
			   idle time, if the package has not already been loaded.
:after         Defer loading of a package until after any of the named
			   features are loaded.
:demand        Prevent deferred loading in all cases.
:if EXPR       Initialize and load only if EXPR evaluates to a non-nil value.
:disabled      The package is ignored completely if this keyword is present.
:defines       Declare certain variables to silence the byte-compiler.
:functions     Declare certain functions to silence the byte-compiler.
:load-path     Add to the `load-path' before attempting to load the package.
:diminish      Support for diminish.el (if installed).
:ensure        Loads the package using package.el if necessary.
:pin           Pin the package to an archive.
#+END_EXAMPLE

* Repositories

#+BEGIN_SRC emacs-lisp
(add-to-list 'package-archives
	     '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives 
             '("org" . "http://orgmode.org/elpa/") t)
#+END_SRC
  
* GUI 

** The file name and the major mode as window name

#+BEGIN_SRC emacs-lisp
(setq-default frame-title-format '("%f [%m]"))
#+END_SRC

** Do not show splash screen, scroll bar nor tool bar
#+begin_src emacs-lisp
(setq inhibit-splash-screen t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
#+end_src

** Use fancy lambdas

Why not?

#+BEGIN_SRC emacs-lisp
  (global-prettify-symbols-mode t)
#+END_SRC

** Highlight current line

=global-hl-line-mode= softly highlights the background color of the line
containing point. It makes it a bit easier to find point, and it's useful
when pairing or presenting code.

#+begin_src emacs-lisp
(global-hl-line-mode 1)
#+end_src

** Set default font and size configuration

#+begin_src emacs-lisp
(setq hrs/default-font "Inconsolata")
(setq hrs/default-font-size 14)
(setq hrs/current-font-size hrs/default-font-size)

(setq hrs/font-change-increment 1.1)

(defun hrs/set-font-size ()
  "Set the font to `hrs/default-font' at `hrs/current-font-size'."
  (set-frame-font
   (concat hrs/default-font "-" (number-to-string hrs/current-font-size))))

(defun hrs/reset-font-size ()
  "Change font size back to `hrs/default-font-size'."
  (interactive)
  (setq hrs/current-font-size hrs/default-font-size)
  (hrs/set-font-size))

(defun hrs/increase-font-size ()
  "Increase current font size by a factor of `hrs/font-change-increment'."
  (interactive)
  (setq hrs/current-font-size
	(ceiling (* hrs/current-font-size hrs/font-change-increment)))
  (hrs/set-font-size))

(defun hrs/decrease-font-size ()
  "Decrease current font size by a factor of `hrs/font-change-increment', down to a minimum size of 1."
  (interactive)
  (setq hrs/current-font-size
	(max 1
	     (floor (/ hrs/current-font-size hrs/font-change-increment))))
  (hrs/set-font-size))

(define-key global-map (kbd "C-)") 'hrs/reset-font-size)
(define-key global-map (kbd "C-+") 'hrs/increase-font-size)
(define-key global-map (kbd "C--") 'hrs/decrease-font-size)

(hrs/reset-font-size)
#+end_src

** Custom theme

#+BEGIN_SRC emacs-lisp
(load-theme 'deeper-blue)
#+END_SRC

** Powerline

#+BEGIN_SRC emacs-lisp
(powerline-center-theme)
#+END_SRC

** Highlight uncommitted changes

Use the =diff-hl= package to highlight changed-and-uncommitted lines
when programming.

#+BEGIN_SRC emacs-lisp
(require 'diff-hl)

(add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
(add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
#+END_SRC

* Set personal information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Oscar Castillo-Felisola"
        user-mail-address "o.castillo.felisola@gmail.com"
        calendar-latitude -33.66
        calendar-longitude -71.51
        calendar-location-name "Valparaiso, CHILE")
#+END_SRC

* Functionalities

** Set =y/n=

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Save backups on a folder

#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist '(("." . "/home/oscar/Software/git.src/mydotfiles/emacs.d/backups")))
#+END_SRC

** Selects the dictionary

#+begin_src emacs-lisp
(ispell-change-dictionary "british" t)
#+end_src

** Turns the orthographic correction (in Flyspell mode) on 

#+begin_src emacs-lisp
(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))
#+end_src

** Open shell

#+begin_src emacs-lisp
(define-key global-map (kbd "<f10>") 'shell)
#+end_src

** Obligates the Enter (or RET) key to indent if necessary

#+begin_src emacs-lisp
(define-key global-map (kbd "RET") 'newline-and-indent)
(setq-default indent-tabs-mode t)
#+end_src

** Configuration of =smex=

#+begin_src emacs-lisp 
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
#+end_src

** Highlight text selection, bracket match, and expression within

#+begin_src emacs-lisp
(transient-mark-mode 1)
(show-paren-mode 1)
(setq show-paren-style 'expression)
#+end_src

** Wrap lines at the edges of windows

#+begin_src emacs-lisp
(setq-default truncate-lines nil)
;; Even for org-mode
;; (setq org-startup-truncated nil)
#+end_src

** Completion

#+begin_src emacs-lisp
(define-key global-map "\C-x\t" 'pcomplete)
#+end_src

** Open files vertically

From [[http://stackoverflow.com/a/6697992/1777293]]

#+BEGIN_SRC emacs-lisp
(defun 2-windows-vertical-to-horizontal ()
  (let ((buffers (mapcar 'window-buffer (window-list))))
    (when (= 2 (length buffers))
      (delete-other-windows)
      (set-window-buffer (split-window-horizontally) (cadr buffers)))))

(add-hook 'emacs-startup-hook '2-windows-vertical-to-horizontal)
#+END_SRC

** Setting a couple of registers

This registers serve as ~shortcuts~ to visit a couple of configuration
files. For /jumping/ to a registers one uses =C-x r j= and the
identifier of the register

#+BEGIN_SRC emacs-lisp
(set-register ?c '(file . "~/Software/git.src/mydotfiles/emacs.d/configuration.org"))
(set-register ?a '(file . "~/Documents/Dropbox/Org/agenda.org"))
#+END_SRC

** Autofill mode enabled

#+BEGIN_SRC emacs-lisp
(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

Sometimes, though, I don’t wanna wrap text. This toggles wrapping with =C-c q=:

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC

** Un-fill paragraph

Taken from *hrs* configuration

#+BEGIN_SRC emacs-lisp
(defun ocf/unfill-paragraph ()
    "Takes a multi-line paragraph and makes it into a single line of text."
    (interactive)
    (let ((fill-column (point-max)))
      (fill-paragraph nil)))
#+END_SRC

And a function to toggle fill/un-fill paragraph
from [[http://ergoemacs.org/emacs/elisp_toggle_command.html][xah's page]]

#+BEGIN_SRC emacs-lisp
(defun ocf/toggle-fill-paragraph ()
  "Toggle fill paragraph Version 2016-09-20"
  (interactive)
  ;; use a property “state”. Value is t or nil
  (if (get 'ocf/toggle-fill-paragraph 'state)
      (progn (ocf/unfill-paragraph)
             (put 'ocf/toggle-fill-paragraph 'state nil))
    (progn
      (fill-paragraph)
      (put 'ocf/toggle-fill-paragraph 'state t))))
#+END_SRC

assigning a keybinding

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-q") 'ocf/toggle-fill-paragraph)
#+END_SRC

** Subword mode enabled

#+BEGIN_SRC emacs-lisp
(subword-mode 1)
#+END_SRC

** Yasnippets

#+BEGIN_SRC emacs-lisp
(require 'yasnippet)
(yas-global-mode 1)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)
(define-key yas-minor-mode-map (kbd "C-<tab>") 'yas-expand)
#+END_SRC

** Extra features of =dired=

I've installed =dired+= and =dired-k=

#+BEGIN_SRC emacs-lisp

#+END_SRC

** Improving =emacs= file name completion

From the webpage [[http://endlessparentheses.com/improving-emacs-file-name-completion.html][endlessparentheses]]
#+BEGIN_SRC emacs-lisp
(mapc (lambda (x)
        (add-to-list 'completion-ignored-extensions x))
      '(".aux" ".bbl" ".blg" ".exe"
        ".log" ".meta" ".out" ".pyg"
        ".synctex.gz" ".tdo" ".toc"
        "-pkg.el" "_latexmk" ".fls"))
#+END_SRC

** Personal commands

I defined the commands for adding inline equations and displaymode
withing =org= and =LaTeX= modes.

- Change to the =*scratch*= buffer
- Use =F3= to start defining a macro
- define your macro
- Use =F4= to the definition
- Use the command =M-x insert-kbd-macro RET RET= to insert the command
  in your buffer.
- Now you can give a name to it and add it to your =.emacs=

*** Inline equation

#+BEGIN_SRC emacs-lisp
(fset 'ocf/inline-eq
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([92 40 92 41 67108914 2] 0 "%d")) arg)))

(global-set-key (kbd "C-¿") 'ocf/inline-eq)
#+END_SRC

*** Display Math Mode

#+BEGIN_SRC emacs-lisp
(fset 'ocf/displaymode
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([92 91 return return 92 93 16] 0 "%d")) arg)))

(global-set-key (kbd "C-¡") 'ocf/displaymode)
#+END_SRC

** =GNUS=

#+BEGIN_SRC emacs-lisp
(setq send-mail-function 'smtpmail-send-it)
#+END_SRC

* Programming Languages 

** Python

Indent 2 spaces.

#+BEGIN_SRC emacs-lisp
  (setq python-indent 2)
#+END_SRC


** =sh=

Indent with 2 spaces.

#+BEGIN_SRC emacs-lisp
  (add-hook 'sh-mode-hook
            (lambda ()
              (setq sh-basic-offset 2
                    sh-indentation 2)))
#+END_SRC


** LaTeX

*** New environments

#+BEGIN_SRC emacs-lisp
(setq latex-block-names '("theorem" "corollary" "proof"
                          "frame" "block" "alertblock"
                          "definition" "example" "align"
                          "align*" "columns" "tikzpicture"
                          "axis" "cases" "matrix" "pmatrix"
                          "vmatrix" "parts" "questions"
                          "solution" "Ebox" "WEbox" "widetext"
                          "dmath" "dmath*" "split" "cdbexample"
			  "cdbexample*"))
#+END_SRC

** Magit and magithub

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC

Magithub can be installed from =MELPA= repository, and needs to be
called after =magit=

#+BEGIN_SRC emacs-lisp
(require 'magithub)
#+END_SRC

It's integrated into =magit= workflow, and it is called with ~H~

* Org-mode configuration

** Settings

#+BEGIN_SRC emacs-lisp
;; (add-to-list 'load-path "/home/oscar/mydotfiles/emacs.d/org-mode/lisp/")
;; (add-to-list 'load-path "/home/oscar/mydotfiles/emacs.d/org-mode/contrib/lisp/" )
#+END_SRC

*** The /alist/ for =org= and =txt= files

 #+BEGIN_SRC emacs-lisp
 (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
 (add-to-list 'auto-mode-alist '("\\.tex$" . latex-mode))
 #+END_SRC

*** Key bindings

 #+BEGIN_SRC emacs-lisp
 (global-set-key "\C-cl" 'org-store-link) 
 (global-set-key "\C-ca" 'org-agenda)
 (global-set-key "\C-cb" 'org-iswitchb)
 (global-set-key "\C-cc" 'org-capture)
 #+END_SRC

*** Indentation

 #+BEGIN_SRC emacs-lisp
 (setq org-indirect-buffer-display 'current-window)
 (setq org-startup-indented t)
 (setq org-src-preserve-indentation nil)
 (setq org-edit-src-content-indentation 0)
 #+END_SRC

