emacs.d/configuration.org
** Display preferences

I like to see an outline of pretty bullets instead of a list of asterisks.

#+BEGIN_SRC emacs-lisp
  (require 'org-bullets)
  (setq org-bullets-bullet-list '("◉" "◎" "⚫" "○" "►" "◇"))
  (add-hook 'org-mode-hook
            (lambda ()
              (org-bullets-mode 1)))

  (setq org-hide-leading-stars t)
#+END_SRC

I like seeing a little downward-pointing arrow instead of the usual ellipsis
(=...=) that org displays when there's stuff under a header.

#+BEGIN_SRC emacs-lisp
  (setq org-ellipsis "⤵")
#+END_SRC

Use syntax highlighting in source blocks while editing.

#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

When editing a code snippet, use the current window rather than popping open a
new one (which shows the same information).

#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'current-window)
#+END_SRC

** Babel: languages and configuration

Active Babel languages:

#+BEGIN_SRC emacs-lisp
;;(require 'ob-ipython)
(org-babel-do-load-languages 'org-babel-load-languages 
  '((R . t) 
    (emacs-lisp . t) 
    (latex . t)
    (python . t)
    (shell . t)
    (gnuplot . t)
    (maxima . t)
    (ledger . t)
    (org . t)
    (octave . t)
    (ipython . t)
    (mathematica . t)
))
#+END_SRC

Don't ask before evaluating code blocks.

#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+END_SRC

One can change the background colours of the programming blocks. In
order to see the available colours, run the command 
=M-x list-colors-display=

#+BEGIN_SRC emacs-lisp
(setq org-src-block-faces '(("emacs-lisp" (:background "DarkSlateGrey"))
			    ("python" (:background "DarkOrange4"))
			    ("ipython" (:background "AntiqueWhite4"))
			    ("latex" (:background "MidnightBlue"))
			    ("shell" (:background "DarkGreen"))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-derived-mode cadabra-mode python-mode "cadabra"
  ; make #a symbol constituent
  (modify-syntax-entry ?# "_" cadabra-mode-syntax-table))
#+END_SRC

** Task management (agenda)

Record the time that a todo was archived.

#+BEGIN_SRC emacs-lisp
  (setq org-log-done 'note)
#+END_SRC

Store my org files in =~/Documents/Dropbox/Org=, 
+maintain an inbox in Dropbox+, 
+define the location of an index file+ (+my main todo list+)
Screencast [[http://2484.de/org-index.html]], 
and archive finished tasks in =~/Documents/Dropdox/Org/archive.org=.

#+BEGIN_SRC emacs-lisp
  (setq org-directory "/home/oscar/Documents/Dropbox/Org")

  (defun org-file-path (filename)
    "Return the absolute address of an org file, given its relative name."
    (concat (file-name-as-directory org-directory) filename))

  ;; (setq org-inbox-file "/home/oscar/Documents/Dropbox/inbox.org")
  ;; (setq org-index-file (org-file-path "index.org"))
  (setq org-archive-location
        (concat (org-file-path "archive.org") "::* From %s"))
#+END_SRC

*** Define a default task to clock in

This has been made following the [[http://doc.norang.ca/org-mode.html][norang's configuration]] page.

#+BEGIN_SRC emacs-lisp
(defvar ocf/organization-task-id "c047fc98-58f3-4291-87e3-99465facb9aa")
#+END_SRC

This number identify the =Task/Organization= in my =agenda.org= file

Now we define a function to clock-in in the default task

#+BEGIN_SRC emacs-lisp
(defun ocf/clock-in-organization-task-as-default ()
  (interactive)
  (org-with-point-at (org-id-find ocf/organization-task-id 'marker)
                     (org-clock-in '(16))))
#+END_SRC

Finally, we assign a =KeyBinding= to our function

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f9> I")
                'ocf/clock-in-organization-task-as-default)
#+END_SRC

*** Personal Todo Sequence

The /LARGE/ sequence, with fast selection 

#+BEGIN_SRC emacs-lisp
(setq org-use-fast-todo-selection t)

(setq org-todo-keywords     
      '((sequence "TODO(t)" "STARTED(s!)" "NEXT(n)" "FEEDBACK(f@/!)" "VERIFY(v)" "WAITING(w@/!)" 
                  "|" "DONE(d)" "DELEGATED(l@/!)" "CANCELLED(c@/!)")
	(sequence "TASK(f)" "|" "DONE(d)")
	(sequence "MAYBE(m)" "|" "CANCELLED(c)")))
#+END_SRC

and their faces... and triggers

#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
      '(("TODO" :foreground "red" :weight bold)
	("MAYBE" . (:foreground "sea green"))
	("TASK" . (:foreground "blue"))
	("STARTED" :foreground "yellow" :weight bold)
	("NEXT" :foreground "blue" :weight bold)
	("FEEDBACK" :foreground "blue" :weight bold)
	("VERIFY" :foreground "magenta" :weight bold)
	("WAITING" :foreground "orange" :weight bold)
	("DONE" :foreground "forest green" :weight bold)
	("DELEGATED" :foreground "forest green" :weight bold)
	("CANCELLED" :foreground "forest green" :weight bold)))

(setq org-todo-state-tags-triggers
      '(("CANCELLED" ("CANCELLED" . t))
	("WAITING" ("WAITING" . t))
	("FEEDBACK" ("WAITING") ("FEEDBACK" . t))
	(done ("WAITING") ("FEEDBACK"))
	("TODO" ("WAITING") ("CANCELLED") ("FEEDBACK"))
	("NEXT" ("WAITING") ("CANCELLED") ("FEEDBACK"))
	("DONE" ("WAITING") ("CANCELLED") ("FEEDBACK"))))
#+END_SRC

*** Agenda files

The =path= to the org-files to be considered in the agenda

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (quote ("/home/oscar/Documents/Dropbox/Org")))
#+END_SRC

*** Agenda custom view

#+BEGIN_SRC emacs-lisp
(setq org-agenda-custom-commands
      '(("h" "Work todos" tags-todo
         "-personal-doat={.+}-dowith={.+}/!-TASK"
         ((org-agenda-todo-ignore-scheduled t)))
        ("H" "All work todos" tags-todo "-personal/!-TASK-MAYBE"
         ((org-agenda-todo-ignore-scheduled nil)))
        ("A" "Work todos with doat or dowith" tags-todo
         "-personal+doat={.+}|dowith={.+}/!-TASK"
         ((org-agenda-todo-ignore-scheduled nil)))
        ("j" "TODO dowith and TASK with"
         ((org-sec-with-view "TODO dowith")
          (org-sec-where-view "TODO doat")
          (org-sec-assigned-with-view "TASK with")
          (org-sec-stuck-with-view "STUCK with")))
        ("J" "Interactive TODO dowith and TASK with"
         ((org-sec-who-view "TODO dowith")))))
#+END_SRC

*** Refile

**** Default note file

#+BEGIN_SRC emacs-lisp
(setq org-default-notes-file "~/git/org/refile.org")
#+END_SRC

**** Targets include this file and any file contributing to the agenda

up to 9 levels deep

#+BEGIN_SRC emacs-lisp
(setq org-refile-targets (quote ((nil :maxlevel . 9)
                                 (org-agenda-files :maxlevel . 9))))
#+END_SRC

**** Use full outline paths for refile targets 

We file directly with IDO and Targets complete directly with IDO

#+BEGIN_SRC emacs-lisp
(setq org-refile-use-outline-path t)
(setq org-outline-path-complete-in-steps nil)
#+END_SRC

**** Allow refile to create parent tasks with confirmation

#+BEGIN_SRC emacs-lisp
(setq org-refile-allow-creating-parent-nodes (quote confirm))
#+END_SRC

**** Use IDO for both buffer and file completion and ido-everywhere to t

#+BEGIN_SRC emacs-lisp
(setq org-completion-use-ido t)
(setq ido-everywhere t)
(setq ido-max-directory-size 100000)
(ido-mode (quote both))
; Use the current window when visiting files and buffers with ido
(setq ido-default-file-method 'selected-window)
(setq ido-default-buffer-method 'selected-window)
; Use the current window for indirect buffer display
(setq org-indirect-buffer-display 'current-window)
#+END_SRC

**** Exclude DONE state tasks from refile targets

#+BEGIN_SRC emacs-lisp
(defun bh/verify-refile-target ()
  "Exclude todo keywords with a done state from refile targets"
  (not (member (nth 2 (org-heading-components)) org-done-keywords)))

(setq org-refile-target-verify-function 'bh/verify-refile-target)
#+END_SRC

** Capture templates

Capture templates for: 
TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol

#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* TODO %?\n%U\n%a\n")
              ("r" "respond" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n")
              ("n" "note" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* %? :NOTE:\n%U\n%a\n")
              ("j" "Journal" entry (file+datetree "~/Documents/Dropbox/Org/diary.org")
               "* %?\n%U\n")
              ("w" "org-protocol" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* TODO Review %c\n%U\n" )
              ("m" "Meeting" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* MEETING with %? :MEETING:\n%U" )
              ("p" "Phone call" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* PHONE %? :PHONE:\n%U\n" )
              ("h" "Habit" entry (file "~/Documents/Dropbox/Org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))
#+END_SRC

** New =org-structure-templates=

#+BEGIN_SRC emacs-lisp
(eval-after-load "org"
  '(add-to-list 'org-structure-template-alist
                '("E" "\\begin\{equation\}\n?\n\\end\{equation\}" "")))
(eval-after-load "org"
  '(add-to-list 'org-structure-template-alist
                '("j" "\\begin\{split\}\n?\n\\end\{split\}" "")))
(eval-after-load "org"
  '(add-to-list 'org-structure-template-alist
                '("C" "#+BEGIN_COMMENT\n?\n#+END_COMMENT" "")))
(eval-after-load "org"
  '(add-to-list 'org-structure-template-alist   
                '("G" "\\begin\{align\}\n?\n\\end\{align\}" "")))  
#+END_SRC

** Properties for inline images 

Set the image width to its original, unless there is a =width=
attribute assigned to it.

#+BEGIN_SRC emacs-lisp
(setq org-image-actual-width nil)
#+END_SRC

Notice that one can set a fixed width by changing =nil= to ='(700)=
where the number indicated the width in pixels

** =org-ref= and =ivy-bibtex=

The main codes are hosted at [[https://github.com/jkitchin/org-ref]] and
[[https://github.com/tmalsburg/helm-bibtex][https://github.com/tmalsburg/helm-bibtex]], were the configuration can
be found.

For =ivy-bibtex= I found this configuration on [[http://nasseralkmim.github.io/blog/2016/08/21/my-latex-environment/#org7788824][this post]]
#+BEGIN_SRC emacs-lisp
(require 'ivy-bibtex)

(setq bibtex-completion-bibliography "/home/oscar/Documents/LatexFiles/References.bib")
(setq bibtex-completion-library-path "/home/oscar/Documents/Bibliography/bibtex-pdfs/")

;; using bibtex path reference to pdf file
(setq bibtex-completion-pdf-field "File")

(setq ivy-bibtex-default-action 'bibtex-completion-insert-citation)
#+END_SRC

For =org-ref= I followed the simple configuration settings

#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-c ["))

(setq org-ref-completion-library 'org-ref-ivy-cite)
(require 'org-ref)

(setq reftex-default-bibliography '("/home/oscar/Documents/LatexFiles/References.bib"))

(setq org-ref-bibliography-notes "/home/oscar/Documents/Dropbox/Org/RefNotes.org"
      org-ref-default-bibliography '("/home/oscar/Documents/LatexFiles/References.bib")
      org-ref-pdf-directory "/home/oscar/Documents/Bibliography/bibtex-pdfs/")

(setq bibtex-completion-bibliography "/home/oscar/Documents/LatexFiles/References.bib"
      bibtex-completion-library-path "/home/oscar/Documents/Bibliography/bibtex-pdfs/")
#+END_SRC

*** Opening the article's PDF

From the helm-bibtex search window, one of the actions is to open the
pdf. This relies on a link in the corresponding BiBTeX entry. When
exporting from Zotero, the files are listed in a file field (there is
no need to export both entries and files, since BetterBibTex will link
directly to the Zotero attached file). You must tell helm-bibtex which
field to look for. It will open all the specified files, by default in
Emacs itself, but you can change this to another viewer as shown:

#+BEGIN_SRC emacs-lisp
(setq  helm-bibtex-pdf-field "file")
(setq helm-bibtex-pdf-open-function
  (lambda (fpath)
    (start-process "evince" "*helm-bibtex-evince*" "/usr/bin/evince" fpath)))
#+END_SRC

*** Requiring extra references 

